benchmarks/logs/2026-05-01_main_arena_lifted/burst_get_bookmarks.txt
Running 30s test @ http://localhost:8080/bookmarks
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.03ms    1.10ms   8.92ms   71.75%
    Req/Sec     2.52k   300.45     4.94k    65.22%
  Latency Distribution
     50%    2.10ms
     75%    2.50ms
     90%    3.15ms
     99%    5.04ms
  150679 requests in 30.10s, 1.59GB read
Requests/sec:   5006.00
Transfer/sec:     54.09MB