benchmarks/logs/2026-05-01_main_arena_lifted/burst_get_index.txt
Running 30s test @ http://localhost:8080/
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   333.91us  125.91us   2.50ms   71.93%
    Req/Sec    14.91k     1.46k   17.55k    57.64%
  Latency Distribution
     50%  296.00us
     75%  409.00us
     90%  513.00us
     99%  719.00us
  893235 requests in 30.10s, 0.90GB read
Requests/sec:  29675.27
Transfer/sec:     30.73MB