benchmarks/logs/2026-05-01_main_arena_lifted/burst_post_bookmarks.txt
Running 10s test @ http://localhost:8080/bookmarks
  1 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    36.53ms   58.00ms 551.40ms   93.89%
    Req/Sec   156.16    149.98     1.28k    92.93%
  Latency Distribution
     50%   24.43ms
     75%   36.71ms
     90%   52.44ms
     99%  357.72ms
  1557 requests in 10.01s, 659.06MB read
Requests/sec:    155.51
Transfer/sec:     65.83MB